#include <stdio.h>
#include <windows.h>
#include "Logger.h"

namespace cov1013
{
	//----------------------------------------------
	// 기본 로그 레벨, 외부에서 설정할 수 있다.
	//----------------------------------------------
	en_LOG_LEVEL	Logger::sm_eLogLevel = eLOG_LEVEL_OFF;

	//----------------------------------------------
	// 동기화를 위한 로그 카운트
	//----------------------------------------------
	DWORD			Logger::sm_dwLogCount = -1;

	//----------------------------------------------
	// 파일 핸들
	//----------------------------------------------
	FILE* Logger::sm_pFileStream = nullptr;

	//----------------------------------------------
	// 파일 핸들 획득을 위한 동기화 객체
	//----------------------------------------------
	SRWLOCK			Logger::sm_pFileStream_srw;

	//----------------------------------------------
	// 디렉터리 이름을 담을 버퍼
	//----------------------------------------------
	wchar_t			Logger::sm_szDirectory[eDIRECTORY_MAX] = { 0 };
}