#pragma once
#include <float.h>

namespace cov1013
{
	/*---------------------------------------------------------------------*/
	// 프로파일러 기본 구성
	/*---------------------------------------------------------------------*/
	enum en_PROFILER_CONPIG
	{
		// String
		eTAG_NAME_MAX = 32,
		eDIRECTORY_MAX = 255,
		eFILE_NAME_MAX = 255,

		// Data
		eSAMPLE_MAX = 100,
		eTHREAD_MAX = 100,
	};

	/*---------------------------------------------------------------------*/
	// 프로파일링 측정 단위
	/*---------------------------------------------------------------------*/
	enum class en_PROFILER_UNIT
	{
		eUNIT_SEC = 1,
		eUNIT_MILLI = 1000,
		eUNIT_MICRO = 1000000,
		eUNIT_NANO = 1000000000,
	};

	/*---------------------------------------------------------------------*/
	// 프로파일링 샘플 데이터
	/*---------------------------------------------------------------------*/
	struct st_SAMPLE
	{
		st_SAMPLE()
		{
			dMax[0] = 0;
			dMax[1] = 0;
			dMin[0] = DBL_MAX;
			dMin[1] = DBL_MAX;
			liCall = 0;
		}
		wchar_t				szTagName[eTAG_NAME_MAX];
		double				dTotal;
		double				dMax[2];
		double				dMin[2];
		unsigned __int64	liCall;
		LARGE_INTEGER		liPerfStart;
	};

	/*---------------------------------------------------------------------*/
	// 프로파일링 스레드 샘플
	/*---------------------------------------------------------------------*/
	struct st_THREAD_SAMPLE
	{
		DWORD		dwThreadID;
		st_SAMPLE	Samples[eSAMPLE_MAX];
	};

	//////////////////////////////////////////////////////////////////////////
	// 프로파일러 초기화
	//////////////////////////////////////////////////////////////////////////
	bool InitializeProfiler(const wchar_t* szDirectory, en_PROFILER_UNIT eUnit);

	//////////////////////////////////////////////////////////////////////////
	// 프로파일러 전용 디렉토리 생성
	//////////////////////////////////////////////////////////////////////////
	bool SetProfilerDirectory(const wchar_t* szDirectory);

	//////////////////////////////////////////////////////////////////////////
	// 프로파일러 정리
	//////////////////////////////////////////////////////////////////////////
	void ReleaseProfiler(void);

	//////////////////////////////////////////////////////////////////////////
	// 프로파일링 시작
	//////////////////////////////////////////////////////////////////////////
	void BeginProfiling(const wchar_t* szTagName);

	//////////////////////////////////////////////////////////////////////////
	// 프로파일링 종료
	//////////////////////////////////////////////////////////////////////////
	void EndProfiling(const wchar_t* szTagName);

	//////////////////////////////////////////////////////////////////////////
	// 프로파일링 데이터 출력
	//////////////////////////////////////////////////////////////////////////
	void OutputProfilingData(void);

	/*---------------------------------------------------------------------*/
	// 매크로 함수
	//
	// 프로파일링을 사용하지 않을 경우와 사용하는 경우 분기
	/*---------------------------------------------------------------------*/
#ifndef __PROFILING__
#define PRO_BEGIN(NONE)
#define PRO_END(NONE)
#else
#define PRO_BEGIN(TAG)	BeginProfiling(TAG);
#define PRO_END(TAG)	EndProfiling(TAG);
#endif
}